/**
 * Пользователь вводит строку
 * Далее он вводит, какую подстроку (слово) надо найти в этой строке
 * Задача 1: вывести номер символа, где начинается это слово с строке
 * Например: Строка: "string", подстрока: "ing", должно вывести 3
 * 
 * Задача 2: Пользователь вводит строку
 * Далее он вводит подстроку (слово), которое надо удалить из этой строки
 * Если этой подстроки нет, то вывести сообщение об этом
 * Иначе - удалить и вывести то, что получилось. (не использовать replace, a splice)
 * 
 * Задача 3: Пользователь вводит строку
 * Далее он вводит два числа через пробел (начало нового слова и конец)
 * Нужно вывести кусок исходной строки (вырезать)
 * 
 * Пример: строка "string", два числа - 2 4, нужно вывести rin (метод split,Number(),slice)
 */